<h2>Soal 1: Pivoting and Melting</h2>

Jelaskan itu pivoting dan melting data

jawaban: Ada beberapa teknik reshaping data di pandas, beberapa diantaranya adalah Pivoting dan Melting.

Pivoting adalah suatu pengubahan bentuk data dengan memutar data yang terletak di baris menjadi di column. Metode untuk melakukan pivoting di pandas yaitu pivot() dan pivot_table(), namun dalam tugas ini menggunakan pivot_table(). Ada beberapa argument di dalam method pivot_table() diantaranya values, index, column, aggfunc, fill_value, margin, dropna, margins_name, observed. Namun pada tugas ini lebih mengutamakan argumen values, index, dan columns saja.<br>
Melting adalah ‘unpivoting’ atau invers dari teknik Pivoting, melting mengubah suatu data dengan memutar dari yang tadinya berada di posisi column menjadi di posisi row. Melting berguna ketika ada suatu kasus dimana terdapat satu atau lebih column yang merupakan identifier variable, dan columnn lain adalah measure variabel. Identifier variabel adalah suatu entitias yang melakukan identifikasi terhadap suatu variabel yang sedang di ukur. Ada beberapa argument di dalam method melt() diantaranya id_vars, value_vars, var_name, value_name, col_level. id_vars adalah columns mana yang akan dijadikan identifier variabel. value_vars adalah columns yang akan menjadi value setelah kita melakukan ‘unpivot’ terhadap variabel, jika tidak di definisikan maka semua column selain id_vars akan dijadikan value_vars.

<h2>Soal 2: Data structure Comprehension</h2>

Data yang rapi adalah:
1. Setiap row menunjukan suatu unit observasi
2. Setiap column merupakan suatu unit variable

Bagaimana pun, dalam menentukan unit observasi itu tergantung dari kasus yang di hadapi. sebagai seorang data scientist pasti akan menemukan berbagai bentuk struktur data. adalah sangat penting bagi seorang data scientist untuk dapat memahami dan menjelaskan setiap struktur data. Kemampuan memahami hubungan antara index baris, column dan isi data adalah kunci untuk memahami informasi apa yang data sedang beritahukan kepada kita.

Di bawah ini terdapat 2 data yang berisi sama, tetapi memiliki struktur yang berbeda. Jelaskan perbedaan dari 2 struktur data tersebut

![alt text](https://drive.google.com/uc?id=1h13CDPzIjc-2XyRcyu-p1fet0Ep1gdMA)

![alt text](https://drive.google.com/uc?id=12ji98ell5tNcCxeBzl4v8qqBtFMgDSr0)

1. Tabel Pertama<br>
Pada tabel pertama menunjukan sebuah data yang sudah di reshaping dari tabel kedua, dimana fokusan tabel tersebut adalah pada rata-rata waktu belajar dengan index atau variable identifier Tipe ujian, dengan berbagai jenis mata pelajaran(columns) yaitu fisika, matematika, dan statistika. Dalam data tersebut rata-rata waktu belajar(menit) adalah value nya atau isi pokok data tersebut.
2. Tabel Kedua<br>
Pada tabel kedua merupakan tabel mentahan dari tabel pertama(tabel yang belum direshaping), dimana tabel tersebut memiliki 3 pokok informasi yaitu Tipe ujian, Mata pelajaran, dan rata-rata waktu belajar(menit). Tabel tersebut terlihat seperti list rata-rata waktu belajar(menit) dengan tipe ujian dan mata pelajaran yang berbeda-beda.

<h2>Soal 3: Reshaping Data 1</h2>

In [2]:
import pandas as pd
import random

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1', 'UTS2', 'UAS2']*3,
    'Mata Pelajaran' : ['Fisika']*4 + ['Matematika']*4+['Statistika']*4,
    'Rata2 Waktu Belajar (menit)' : [random.choice(range(200, 800)) for i in range(12)],
    'Rata2 Nilai Ujian' : [random.choice(range(40, 100)) for i in range(12)] 
}
df = pd.DataFrame(data)
df

,Tipe Ujian,Test,Mata Pelajaran,Rata2 Waktu Belajar (menit),Rata2 Nilai Ujian
0,UTS1,A,Fisika,768,96
1,UAS1,B,Fisika,387,80
2,UTS2,C,Fisika,215,92
3,UAS2,D,Fisika,452,68
4,UTS1,A,Matematika,539,69
5,UAS1,B,Matematika,413,68
6,UTS2,C,Matematika,358,43
7,UAS2,D,Matematika,293,70
8,UTS1,A,Statistika,758,49
9,UAS1,B,Statistika,435,61
10,UTS2,C,Statistika,692,58
11,UAS2,D,Statistika,427,89

Perhatikan data di atas, kemudian ubahlah bentuknya agar sesuai yang di harapkan.

In [4]:
# code here
pivot_result = df.pivot_table(values=['Rata2 Nilai Ujian','Rata2 Waktu Belajar (menit)'], index='Tipe Ujian', columns='Mata Pelajaran')
pivot_result

                Rata2 Nilai Ujian                        \
Mata Pelajaran             Fisika Matematika Statistika
Test Tipe Ujian
A    UTS1                      96         69         49
B    UAS1                      80         68         61
C    UTS2                      92         43         58
D    UAS2                      68         70         89

                Rata2 Waktu Belajar (menit)
Mata Pelajaran                       Fisika Matematika Statistika
Test Tipe Ujian
A    UTS1                               768        539        758
B    UAS1                               387        413        435
C    UTS2                               215        358        692
D    UAS2                               452        293        427

Expected Result:

![alt text](https://drive.google.com/uc?id=1XufsfqZe7-XZLsb92SpATexy-QRZE0ow)

<h2>Soal 4: Reshaping Data 2</h2>

In [46]:
import pandas as pd

data = {
    'Hari' : ['Sabtu', 'Minggu'],
    'Kebun Binatang' : [271, 399],
    'Dufan' : [501, 700],
    'Disney' : [1000, 1001],
    'Bali' : [900, 803]
}
df = pd.DataFrame(data).set_index('Hari')
df

        Kebun Binatang  Dufan  Disney  Bali
Hari
Sabtu              271    501    1000   900
Minggu             399    700    1001   803

In [47]:
df_dengan_hari = df.reset_index()
display(pd.melt(df_dengan_hari, id_vars =['Hari'], var_name = 'Tempat Hiburan', value_name = 'Pengunjung'))

     Hari  Tempat Hiburan  Pengunjung
0   Sabtu  Kebun Binatang         271
1  Minggu  Kebun Binatang         399
2   Sabtu           Dufan         501
3  Minggu           Dufan         700
4   Sabtu          Disney        1000
5  Minggu          Disney        1001
6   Sabtu            Bali         900
7  Minggu            Bali         803

diatas adalah data tentang jumlah pengunjung di berbagai tempat hiburan, ubahlah struktur data tersebut sehingga sesuai dengan hasil yang diharapkan.

Expected Result:

![alt text](https://drive.google.com/uc?id=159mIqcyfeD30EEcyZmmkovORa6cZDLtn)

<h2>Soal 5: Pivoting and Aggregating</h2>

In [5]:
import pandas as pd

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1']*3,
    'Mata Pelajaran' :['Statistika', 'Fisika', 'Fisika', 'Statistika', 'Fisika', 'Statistika'],
    'Jumlah Peserta' : [14, 17, 12, 16, 14, 13]
}
df = pd.DataFrame(data).set_index('Tipe Ujian')
df

           Mata Pelajaran  Jumlah Peserta
Tipe Ujian
UTS1           Statistika              14
UAS1               Fisika              17
UTS1               Fisika              12
UAS1           Statistika              16
UTS1               Fisika              14
UAS1           Statistika              13

Perhatikan bahwa data jumlah peserta ujian untuk suatu tipe ujian dan mata pelajaran tertentu ada yang duplikat, ubahlah struktur data tersebut dan lakukan aggregasi berjenis jumlah sehingga sesuai dengan hasil yang di harapkan

Expected Result:

![alt text](https://drive.google.com/uc?id=1emoz7orYR-0mCHffvAgM8j-V1P6yVHf0)

In [6]:
#Code here
df.pivot_table(values='Jumlah Peserta', index='Tipe Ujian', columns='Mata Pelajaran', aggfunc ='sum')

Mata Pelajaran  Fisika  Statistika
Tipe Ujian
UAS1                17          29
UTS1                26          14